In [1]:
import numpy as np
import pandas as pd
import pylab as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

### Loading actor.csv to start cleaning. 

#### Cleaning process in this case will imply checking duplicates and dropping last_update column as it does not give us important information

In [2]:
data_actor = pd.read_csv(r'C:\Users\pombo\OneDrive\Escritorio\Ironhack\Labs\Day15Proy\w3-database-project\data\actor.csv', encoding='latin1' )
pd.set_option('display.max_columns', None)

data_actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [16]:
data_actor = data_actor.drop('last_update',axis=1)

In [17]:
data_actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

### Loading category.csv to start cleaning. 

#### Cleaning process in this case will imply checking duplicates and dropping last_update column as it does not give us important information

In [5]:
data_category = pd.read_csv(r'C:\Users\pombo\OneDrive\Escritorio\Ironhack\Labs\Day15Proy\w3-database-project\data\category.csv', encoding='latin1' )
pd.set_option('display.max_columns', None)

data_category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [18]:
data_category = data_category.drop('last_update',axis=1)
data_category.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

### Loading film.csv to start cleaning. 

#### Cleaning process in this case will imply checking duplicates and dropping last_update column as it does not give us important information

In [7]:
data_film = pd.read_csv(r'C:\Users\pombo\OneDrive\Escritorio\Ironhack\Labs\Day15Proy\w3-database-project\data\film.csv', encoding='latin1' )
pd.set_option('display.max_columns', None)

data_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [19]:
data_film = data_film.drop('last_update',axis=1)
data_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes

### Loading inventory.csv to start cleaning. 

#### Cleaning process in this case will imply checking duplicates and dropping last_update column as it does not give us important information

In [9]:
data_inventory = pd.read_csv(r'C:\Users\pombo\OneDrive\Escritorio\Ironhack\Labs\Day15Proy\w3-database-project\data\inventory.csv', encoding='latin1' )
pd.set_option('display.max_columns', None)

data_inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [20]:
data_inventory = data_inventory.drop('last_update',axis=1)
data_inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

### Loading language.csv to start cleaning. 

#### Cleaning process in this case will imply checking duplicates and dropping last_update column as it does not give us important information

In [11]:
data_language = pd.read_csv(r'C:\Users\pombo\OneDrive\Escritorio\Ironhack\Labs\Day15Proy\w3-database-project\data\language.csv', encoding='latin1' )
pd.set_option('display.max_columns', None)

data_language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [21]:
data_language = data_language.drop('last_update',axis=1)
data_language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

### Loading rental.csv to start cleaning. 

#### Cleaning process in this case will imply checking duplicates and dropping last_update column as it does not give us important information

In [14]:
data_rental = pd.read_csv(r'C:\Users\pombo\OneDrive\Escritorio\Ironhack\Labs\Day15Proy\w3-database-project\data\rental.csv', encoding='latin1' )
pd.set_option('display.max_columns', None)

data_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [22]:
data_rental = data_rental.drop('last_update',axis=1)
data_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

### Loading old_HDD.csv to start cleaning. 

#### Cleaning process in this case will imply checking duplicates

In [15]:
data_old_HDD = pd.read_csv(r'C:\Users\pombo\OneDrive\Escritorio\Ironhack\Labs\Day15Proy\w3-database-project\data\old_HDD.csv', encoding='latin1' )
pd.set_option('display.max_columns', None)

data_old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14